## Staging: cloudfront
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `aws_iam_policy.write_waf_logs`                                         |
|        | `aws_iam_role.waf_log_role`                                             |
|        | `aws_iam_role_policy_attachment.write_waf_logs`                         |
|        | `aws_kinesis_firehose_delivery_stream.api`                              |
|        | `aws_wafv2_web_acl_logging_configuration.api`                           |
| delete | `aws_cloudwatch_log_group.wafv2-log-group`                              |
|        | `aws_cloudwatch_log_metric_filter.wafv2-log-metric-filter`              |
|        | `aws_cloudwatch_log_metric_filter.wafv2-log-metric-filter-health-check` |
|        | `aws_kms_key.wafv2-log-group-kms-key`                                   |
|        | `aws_wafv2_ip_set.aws-route53-healthchecks-all-regions`                 |
|        | `aws_wafv2_web_acl_logging_configuration.waf_logging_configuration`     |
| update | `aws_wafv2_web_acl.api_waf`                                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.wafv2-log-group will be destroyed
  # (because aws_cloudwatch_log_group.wafv2-log-group is not in configuration)
  - resource "aws_cloudwatch_log_group" "wafv2-log-group" {
      - arn               = "arn:aws:logs:us-east-1:843973686572:log-group:aws-waf-logs-url-shortener" -> null
      - id                = "aws-waf-logs-url-shortener" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:843973686572:key/ddb6b860-d505-4571-874f-c31f5d5567b6" -> null
      - name              = "aws-waf-logs-url-shortener" -> null
      - retention_in_days = 90 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_log_metric_filter.wafv2-log-metric-filter will be destroyed
  # (because aws_cloudwatch_log_metric_filter.wafv2-log-metric-filter is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "wafv2-log-metric-filter" {
      - id             = "aws-waf-logs-url-shortener-metric-filter" -> null
      - log_group_name = "aws-waf-logs-url-shortener" -> null
      - name           = "aws-waf-logs-url-shortener-metric-filter" -> null
      - pattern        = "{ $.httpRequest.uri != \"/version\" }" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "RequestCount" -> null
          - namespace  = "UserTraffic" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.wafv2-log-metric-filter-health-check will be destroyed
  # (because aws_cloudwatch_log_metric_filter.wafv2-log-metric-filter-health-check is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "wafv2-log-metric-filter-health-check" {
      - id             = "aws-waf-logs-url-shortener-metric-filter-health-check" -> null
      - log_group_name = "aws-waf-logs-url-shortener" -> null
      - name           = "aws-waf-logs-url-shortener-metric-filter-health-check" -> null
      - pattern        = "{ $.httpRequest.uri = \"/version\" }" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "RequestCount" -> null
          - namespace  = "HealthCheckTraffic" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_iam_policy.write_waf_logs will be created
  + resource "aws_iam_policy" "write_waf_logs" {
      + arn         = (known after apply)
      + description = "Allow Firehose to write WAF logs to S3"
      + id          = (known after apply)
      + name        = "url-shortener-waf-logs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-843973686572"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject*",
                          + "s3:GetObject*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-843973686572/waf_acl_logs/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.waf_log_role will be created
  + resource "aws_iam_role" "waf_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "url-shortener-waf-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.write_waf_logs will be created
  + resource "aws_iam_role_policy_attachment" "write_waf_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "url-shortener-waf-logs"
    }

  # aws_kinesis_firehose_delivery_stream.api will be created
  + resource "aws_kinesis_firehose_delivery_stream" "api" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-url-shortener"
      + tags           = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-843973686572"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/843973686572/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled = false
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_kms_key.wafv2-log-group-kms-key will be destroyed
  # (because aws_kms_key.wafv2-log-group-kms-key is not in configuration)
  - resource "aws_kms_key" "wafv2-log-group-kms-key" {
      - arn                                = "arn:aws:kms:us-east-1:843973686572:key/ddb6b860-d505-4571-874f-c31f5d5567b6" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "WAF Cloudwatch logs KMS key" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "ddb6b860-d505-4571-874f-c31f5d5567b6" -> null
      - is_enabled                         = true -> null
      - key_id                             = "ddb6b860-d505-4571-874f-c31f5d5567b6" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::843973686572:root"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowKMSAllAccess"
                    },
                  - {
                      - Action    = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt*",
                          - "kms:Describe*",
                          - "kms:Decrypt*",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logs.us-east-1.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowKMSAccessToCloudWatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                               = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_wafv2_ip_set.aws-route53-healthchecks-all-regions will be destroyed
  # (because aws_wafv2_ip_set.aws-route53-healthchecks-all-regions is not in configuration)
  - resource "aws_wafv2_ip_set" "aws-route53-healthchecks-all-regions" {
      - addresses          = [
          - "107.23.255.0/26",
          - "15.177.0.0/18",
          - "176.34.159.192/26",
          - "177.71.207.128/26",
          - "52.80.197.0/25",
          - "52.80.197.128/25",
          - "52.80.198.0/25",
          - "52.83.34.128/25",
          - "52.83.35.0/25",
          - "52.83.35.128/25",
          - "54.183.255.128/26",
          - "54.228.16.0/26",
          - "54.232.40.64/26",
          - "54.241.32.64/26",
          - "54.243.31.192/26",
          - "54.244.52.192/26",
          - "54.245.168.0/26",
          - "54.248.220.0/26",
          - "54.250.253.192/26",
          - "54.251.31.128/26",
          - "54.252.254.192/26",
          - "54.252.79.128/26",
          - "54.255.254.192/26",
        ] -> null
      - arn                = "arn:aws:wafv2:us-east-1:843973686572:global/ipset/aws-route53-healthchecks-all-regions/89ee1537-72aa-4436-9938-2c249c3cd95a" -> null
      - description        = "AWS Route 53 Healthchecks all regions" -> null
      - id                 = "89ee1537-72aa-4436-9938-2c249c3cd95a" -> null
      - ip_address_version = "IPV4" -> null
      - lock_token         = "da369ead-1896-4ff3-bf9a-0587a3be80de" -> null
      - name               = "aws-route53-healthchecks-all-regions" -> null
      - scope              = "CLOUDFRONT" -> null
      - tags               = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "url-shortener-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_wafv2_web_acl.api_waf will be updated in-place
  ~ resource "aws_wafv2_web_acl" "api_waf" {
        id          = "3b75fcdd-f01d-467b-92c2-cbb021fea8e9"
        name        = "url-shortener-waf"
        tags        = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

      - rule {
          - name     = "AWSRoute53HealthchecksAllRegions" -> null
          - priority = 3 -> null

          - action {
              - allow {
                }
            }

          - statement {

              - ip_set_reference_statement {
                  - arn = "arn:aws:wafv2:us-east-1:843973686572:global/ipset/aws-route53-healthchecks-all-regions/89ee1537-72aa-4436-9938-2c249c3cd95a" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSRoute53HealthchecksAllRegions" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 30 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 30

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 40 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 40

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 50 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 50

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (6 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.api will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "api" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:us-east-1:843973686572:global/webacl/url-shortener-waf/3b75fcdd-f01d-467b-92c2-cbb021fea8e9"
    }

  # aws_wafv2_web_acl_logging_configuration.waf_logging_configuration will be destroyed
  # (because aws_wafv2_web_acl_logging_configuration.waf_logging_configuration is not in configuration)
  - resource "aws_wafv2_web_acl_logging_configuration" "waf_logging_configuration" {
      - id                      = "arn:aws:wafv2:us-east-1:843973686572:global/webacl/url-shortener-waf/3b75fcdd-f01d-467b-92c2-cbb021fea8e9" -> null
      - log_destination_configs = [
          - "arn:aws:logs:us-east-1:843973686572:log-group:aws-waf-logs-url-shortener",
        ] -> null
      - resource_arn            = "arn:aws:wafv2:us-east-1:843973686572:global/webacl/url-shortener-waf/3b75fcdd-f01d-467b-92c2-cbb021fea8e9" -> null
    }

Plan: 5 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
